security-service-webproxy/src/test/resources/tokenRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.security.ventyx.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:generateToken>
            <!--Optional:-->
            <arg0>
                <!--Optional:-->
                <applicationId>?</applicationId>
                <!--Optional:-->
                <applicationPassword>?</applicationPassword>
                <!--Optional:-->
                <applicationUser>?</applicationUser>
                <!--Optional:-->
                <serviceName>?</serviceName>
                <!--Optional:-->
                <tokenFormat>?</tokenFormat>
                <!--Optional:-->
                <userPassword>?</userPassword>
                <!--Optional:-->
                <userPrincipal>?</userPrincipal>
            </arg0>
        </web:generateToken>
    </soapenv:Body>
</soapenv:Envelope>